sonicFoam/forwardSteptoSonicFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1041.263 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1041.263 0 0);
    }

    sym
    {
        type            slip;
    }

    wedge
    {
        type            slip;
    }

    top
    {
        type            slip;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (1041.263 0 0);
        value           uniform (1041.263 0 0);
    }
}


// ************************************************************************* //
