sonicFoam/forwardSteptoSonicFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|e).*"
    {
        $p;
        tolerance       1e-05;
        relTol          0;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors      2;
    nNonOrthogonalCorrectors 1;

    // Add these for high Courant number cases
    momentumPredictor   yes;
    transonic           yes;    // Important for supersonic flow

    // Optional: Consider adding these for more stability
    // consisten        yes;
    // nOuterIterations 2;
}

// Add stronger relaxation
relaxationFactors
{
    fields
    {
        p               0.3;
        rho             0.3;
    }
    equations
    {
        U               0.5;
        e               0.5;
        "(k|epsilon|omega)" 0.5;
    }
}

// ************************************************************************* //
